// Вам будет предоставлен массив чисел. 
// Вы должны отсортировать нечетные числа в порядке возрастания, 
// оставив четные числа на своих исходных позициях.
// sort[9, 8, 7, 6, 5, 4, 3, 2, 1, 0] => [1, 8, 3, 6, 5, 4, 7, 2, 9, 0]
// sort[31, 3, 27, 9, 5, 7, 10, 2, 1, 0] => [1,  3, 5,  7, 9, 27, 10, 2, 31, 0]
function sort(arr) {
  odd = arr.filter(item => item % 2 == 1).sort((a, b) => a - b);
  return arr.map((item) => item % 2 ? odd.shift() : item);
}

console.log(sort([31, 3, 27, 9, 5, 7, 10, 2, 1, 0]));