// В супермаркете есть кассы самообслуживания. 
// Ваша задача написать функцию, которая вычисляет время, которое требуется покупателям заплатить за товары.
// В качестве параметра передан массив положительных чисел, который представляет очередь,
//  а каждый элемент (число) - это время, необходимое (каждому) покупателю для того, чтобы расплатиться.
// Второй параметр n - это количество касс. Функция должна возвращать число.

// Например:

// queueTime([1,2,3,4], 1) --> 10


let queueTime = (a, b) => {
  return a.reduce((sum, item) => sum + item,0)/b;
}

console.log(queueTime([1,2,3,4], 3))
  
