<<<<<<< HEAD
// В супермаркете есть кассы самообслуживания. 
// Ваша задача написать функцию, которая вычисляет время, которое требуется покупателям заплатить за товары.
// В качестве параметра передан массив положительных чисел, который представляет очередь,
//  а каждый элемент (число) - это время, необходимое (каждому) покупателю для того, чтобы расплатиться.
// Второй параметр n - это количество касс. Функция должна возвращать число.

// Например:

// queueTime([1,2,3,4], 1) --> 10


let queueTime = (a, b) => {
  return a.reduce((sum, item) => sum + item,0)/b;
}

console.log(queueTime([1,2,3,4], 3))
  
=======
// Найдите недостающую букву.

// Напишите функцию, которая принимает в качестве параметра массив букв, 
// расположенных по алфавиту и возвращает массив с недостающей буквой. 
// Длина входного массива не меньше 2 и он содержит буквы только одного регистра.

// Например:

// findMissingLetter(['a','b','c','d','f']) -> 'e'


function findMissingLetter(arr){
  let num = 97;
  for(let letter of arr){
      if(letter.charCodeAt(0) !== num) return String.fromCharCode(num);
      num++;
  }
  return String.fromCharCode(num)  
}
console.log(findMissingLetter(['a','b','c','d','f']))
>>>>>>> 83f76ca832e7280b2efc8cb7e2b44135c40c6607
