// Вам предоставляется массив (который будет иметь длину не менее 3, но может быть очень большим), 
// содержащий целые числа. Массив либо полностью состоит из нечетных целых чисел, либо полностью состоит из четных целых чисел, 
// за исключением одного целого числа N. Напишите метод, который принимает массив в качестве аргумента и возвращает этот «выброс» N. 
// findOutlier([0, 1, 2]) => 1
// findOutlier([1, 2, 3]) => 2
// findOutlier([2,6,8,10,3]) => 3
// findOutlier([1,1,0,1,1]) => 0
function findOutlier(arr) {
  chet = arr.filter(item => item %2 == 0).join('')
  nech = arr.filter(item => item %2 !== 0).join('')
  if (chet.length < nech.length) {
    return +chet
  } else {
    return +nech
  }
}
console.log(findOutlier([46251630,17391312,-13326622,85079472,196352686,-44951968,-61435400,-195092615,98710390,-35164198,128611144,161413790,109363822,-35853122,-192821436,134577410,47359398,91272488,-101048380,-24511986,145857816,-16712240,-91095386,196133194,-131000782,-163388220,-97894980,24890214,59621210,-111628562]));