// Для того, чтобы обеспечить безопасность данных при оплате онлайн, 
// нам необходимо замаскировать все цифры банковского счета, кроме последних четырех.

// Ваша задача написать функцию, которая принимает в качестве параметра строку, 
// состоящую из цифр, заменяет все элементы на '#', кроме последних четырех и возвращает ее

// Например:
// maskify("4556364607935616") --> "############5616"


let maskify = str => {
  return ([...str].map(x=>'#').join('')+str.slice(-4)).slice(-str.length);
}

console.log(maskify('4556364607935616'));
