// Функция rgb не завершена. Завершите его так, чтобы передача десятичных значений RGB приводила к возврату шестнадцатеричного представления. 
// Допустимые десятичные значения для RGB: 0 - 255. Любые значения, выходящие за пределы этого диапазона, должны быть округлены до ближайшего допустимого значения.
// Ваш ответ всегда должен состоять из 6 символов, сокращение с 3 здесь не работает.

// rgb(255, 255, 255) => FFFFFF
// rgb(255, 255, 300) => FFFFFF
// rgb(0,0,0) => 000000
// rgb(148, 0, 211) => 9400D3

function rgb(r, g, b)  {
  r16 = (r <= 0 ? (r = 0).toString(16) + (0).toString(16) : r.toString(16)) || (r < 255 ? (r = 255).toString(16) : r.toString(16))
  g16 = (g <= 0 ? (g = 0).toString(16) + (0).toString(16) : g.toString(16)) || (g < 255 ? (g = 255).toString(16) : g.toString(16))
  b16 = (b <= 0 ? (b = 0).toString(16) + (0).toString(16) : b.toString(16)) || (b < 255 ? (b = 255).toString(16) : b.toString(16))
  // if(r > 255 )

  str = `${r16}${g16}${b16}`
  return str
}

console.log(rgb(300,0,0));

