// Функция rgb не завершена. Завершите его так, чтобы передача десятичных значений RGB приводила к возврату шестнадцатеричного представления. 
// Допустимые десятичные значения для RGB: 0 - 255. Любые значения, выходящие за пределы этого диапазона, должны быть округлены до ближайшего допустимого значения.
// Ваш ответ всегда должен состоять из 6 символов, сокращение с 3 здесь не работает.

// rgb(255, 255, 255) => FFFFFF
// rgb(255, 255, 300) => FFFFFF
// rgb(0,0,0) => 000000
// rgb(148, 0, 211) => 9400D3

function rgb(r, g, b) {
  const convert = function(val) {
    if(val < 0) {
      return '00';
    }
    if(val > 255) {
      return 'FF';
    }
    return (val > 15 ? val.toString(16) : '0' + val.toString(16)).toUpperCase();
  }
  return convert(r) + convert(g) + convert(b); 
}

console.log(rgb(333,255,47));

