// Боб готовится сдать тест на IQ. Наиболее частая задача в этом тесте - выяснить, 
// какое из заданных чисел отличается от других. Боб заметил, что одно число обычно отличается от других ровностью. 
// Помогите Бобу - чтобы проверить его ответы, ему нужна программа, которая среди заданных 
// чисел находит другое по четности и возвращает позицию этого числа.
// Имейте в виду, что ваша задача - помочь Бобу пройти настоящий тест на IQ, 
// что означает, что индексы элементов начинаются с 1 (а не с 0).

function iqTest(str) {
  mas = str.split(' ')
  chet = mas.filter(item => item %2 == 0)
  nech = mas.filter(item => item %2 == 1)
  if (nech.length > chet.length) {
    pos = mas.findIndex(item => item%2 == 0)
    return +pos + 1
    } else {
      pos = mas.findIndex(item => item%2 == 1)
      return +pos + 1
    }
  }

console.log(iqTest("2 4 7 8 10"));

